<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of DaVinci Resolve Studio 17.

This recipe is a modification of Tim Sutton's original v14
recipe.

This product requires registration in order to download, so
you _must_ override all input variables beginning with 'REG_'
and they must contain data.

Notably, REG_STATE and REG_COUNTRY must contain sane values:
- REG_COUNTRY is of the form 'us', 'ca', etc.
- REG_STATE is a proper name, i.e. 'Maryland'.
</string>
    <key>Identifier</key>
    <string>com.github.milk-studios.download.DaVinciResolveStudio17</string>
    <key>ParentRecipe</key>
    <string>com.github.timsutton.download.davinciresolve14</string>
    <key>Input</key>
    <dict>
        <key>PRODUCT_NAME_PATTERN</key>
        <string>^DaVinci Resolve Studio(?P&lt;version&gt;17(\.\d+)*)( Update)*$</string>
        <key>NAME</key>
        <string>DaVinciResolveStudio17</string>
        <key>REG_FIRSTNAME</key>
        <string></string>
        <key>REG_LASTNAME</key>
        <string></string>
        <key>REG_EMAIL</key>
        <string></string>
        <key>REG_PHONE</key>
        <string></string>
        <key>REG_CITY</key>
        <string></string>
        <key>REG_STATE</key>
        <string></string>
        <key>REG_COUNTRY</key>
        <string></string>
    </dict>
</dict>
</plist>